app/Helpers/account_helper.php

    function current_account(): ?array
    {
        static $account = null;
        static $checked = false;

        if ($checked) {
            return $account;
        }
        $checked = true;

        $token = service('request')->getCookie('account');
        if (! $token) {
            return null;
        }

        $row = db_connect()->table('account_sessions')
            ->select('accounts.id, accounts.naam')
            ->join('accounts', 'accounts.id = account_sessions.account_id')
            ->where('account_sessions.token', $token)
            ->get()
            ->getRowArray();
---
SELECT `accounts`.`id`, `accounts`.`naam`
FROM `account_sessions`
JOIN `accounts` ON `accounts`.`id` = `account_sessions`.`account_id`
WHERE `account_sessions`.`token` = '02e135cb1fdb7453d4b7cd915c057ecdcf35785f3ec3f25a3265e6b8783658f5'