app/Controllers/Box.php

INSERT INTO `boxes` (`nummer`, `token`, `status`, `created_at`, `updated_at`) VALUES (1, 'abcd', 'leeg', '2026-09-20 19:45:57', '2026-09-20 19:45:57')
SELECT *
FROM `boxes`
WHERE `boxes`.`id` = 1
---
    private function loadBox(int $nummer, string $token): array|ResponseInterface
    {
        $box = $this->boxes->findByNummer($nummer);

        if ($box) {
            if (! hash_equals($box['token'], $token)) {
                return $this->unknown($token);
            }

            return $box;
        }

        $id = $this->boxes->insert([
            'nummer' => $nummer,
            'token'  => $token,
            'status' => 'leeg',
        ], true);

        return $this->boxes->find($id);

UPDATE `boxes` SET `omschrijving` = 'Servies: borden en kommen', `eigenaar` = 'Irma', `einddoel` = 'Keuken', `huidige_locatie` = 'Zolder', `status` = 'ingepakt', `fragiel` = 1, `eerst_openen` = 0, `ingepakt_door` = 'Edwin', `ingepakt_op` = '2026-09-20 19:46:18', `updated_at` = '2026-09-20 19:46:18'
WHERE `boxes`.`id` IN (1)
INSERT INTO `movements` (`box_id`, `van_locatie`, `naar_locatie`, `door`, `op`, `batch_id`) VALUES (1, NULL, 'Zolder', 'Edwin', '2026-09-20 19:46:18', NULL)
---
    public function store(int $nummer, string $token)
    {
        $box = $this->loadBox($nummer, $token);
        if ($box instanceof ResponseInterface) {
            return $box;
        }

        $omschrijving = trim((string) $this->request->getPost('omschrijving'));
        $eigenaar     = trim((string) $this->request->getPost('eigenaar'));
        $einddoel     = trim((string) $this->request->getPost('einddoel'));
        $fragiel      = (bool) $this->request->getPost('fragiel');
        $eerstOpenen  = (bool) $this->request->getPost('eerst_openen');
        $naam         = current_account_naam();

        if ($einddoel !== '') {
            $this->locations->remember($einddoel, 'nieuw huis');
        }

        if ($box['status'] === 'leeg') {
            $plek = trim((string) $this->request->getPost('huidige_locatie'));
            if ($plek !== '') {
                $this->locations->remember($plek, 'huis');
            }

            $this->boxes->update((int) $box['id'], [
                'omschrijving'    => $omschrijving,
                'eigenaar'        => $eigenaar,
                'einddoel'        => $einddoel,
                'huidige_locatie' => $plek,
                'status'          => 'ingepakt',
                'fragiel'         => $fragiel,
                'eerst_openen'    => $eerstOpenen,
                'ingepakt_door'   => $naam,
                'ingepakt_op'     => date('Y-m-d H:i:s'),
            ]);

            $this->movements->insert([
                'box_id'       => (int) $box['id'],
                'van_locatie'  => null,
                'naar_locatie' => $plek,
                'door'         => $naam,
                'op'           => date('Y-m-d H:i:s'),
                'batch_id'     => null,
            ]);

UPDATE `boxes` SET `omschrijving` = 'TEST-EDIT-1', `eigenaar` = 'Irma', `einddoel` = 'Keuken', `fragiel` = 0, `eerst_openen` = 0, `updated_at` = '2026-09-20 19:48:16'
WHERE `boxes`.`id` IN (1)
---
            return redirect()->to('/d/' . $nummer . '-' . $token . '?saved=1');
        }

        $this->boxes->update((int) $box['id'], [
            'omschrijving' => $omschrijving,
            'eigenaar'     => $eigenaar,
            'einddoel'     => $einddoel,
            'fragiel'      => $fragiel,
            'eerst_openen' => $eerstOpenen,
        ]);

INSERT INTO `photos` (`box_id`, `bestandsnaam`, `op`) VALUES (1, '1789933784_5b6234f1f1fa6138dc28.jpg', '2026-09-20 19:49:44')
---
    public function photo(int $nummer, string $token)
    {
        $box = $this->loadBox($nummer, $token);
        if ($box instanceof ResponseInterface) {
            return $this->response->setStatusCode(404)->setJSON(['ok' => false]);
        }

        $file = $this->request->getFile('foto');
        if (! $file || ! $file->isValid()) {
            return $this->response->setStatusCode(400)->setJSON(['ok' => false, 'error' => 'Geen geldig bestand']);
        }

        $dir = WRITEPATH . 'uploads/boxes/' . $box['id'];
        if (! is_dir($dir)) {
            mkdir($dir, 0755, true);
        }

        $name = $file->getRandomName();
        $file->move($dir, $name);

        $id = $this->photos->insert([
            'box_id'       => (int) $box['id'],
            'bestandsnaam' => $name,
            'op'           => date('Y-m-d H:i:s'),
        ], true);

UPDATE `boxes` SET `status` = 'geopend', `omschrijving` = 'Servies: borden en kommen\n\n[20-09-2026] Eruit gehaald: Twee kabels', `updated_at` = '2026-09-20 19:49:43'
WHERE `boxes`.`id` IN (1)
---
    public function status(int $nummer, string $token)
    {
        $box = $this->loadBox($nummer, $token);
        if ($box instanceof ResponseInterface) {
            return $box;
        }

        $status = $this->request->getPost('status');
        $data   = [];

        if ($status === 'geopend') {
            $notitie = trim((string) $this->request->getPost('notitie'));
            $data['status'] = 'geopend';
            if ($notitie !== '') {
                $regel = '[' . date('d-m-Y') . '] Eruit gehaald: ' . $notitie;
                $data['omschrijving'] = trim($box['omschrijving'] . "\n\n" . $regel);
            }
        } elseif ($status === 'uitgepakt') {
            $data['status'] = 'uitgepakt';
        }

        if ($data) {
            $this->boxes->update((int) $box['id'], $data);

INSERT INTO `movements` (`box_id`, `van_locatie`, `naar_locatie`, `door`, `op`, `batch_id`) VALUES (1, 'Opslag rij 3', 'Nieuw huis woonkamer', 'Edwin', '2026-09-20 19:49:44', NULL)
UPDATE `boxes` SET `huidige_locatie` = 'Nieuw huis woonkamer', `updated_at` = '2026-09-20 19:49:44'
WHERE `boxes`.`id` IN (1)
---
    public function move(int $nummer, string $token)
    {
        $box = $this->loadBox($nummer, $token);
        if ($box instanceof ResponseInterface) {
            return $box;
        }

        $naar = trim((string) $this->request->getPost('naar_locatie'));
        if ($naar === '') {
            return redirect()->to('/d/' . $nummer . '-' . $token);
        }

        $naam = current_account_naam();
        $this->movements->insert([
            'box_id'       => (int) $box['id'],
            'van_locatie'  => $box['huidige_locatie'],
            'naar_locatie' => $naar,
            'door'         => $naam,
            'op'           => date('Y-m-d H:i:s'),
            'batch_id'     => null,
        ]);

        $update = ['huidige_locatie' => $naar];
        if ($box['status'] === 'ingepakt') {
            $update['status'] = 'opgeslagen';
        }
        $this->boxes->update((int) $box['id'], $update);