app/Controllers/Csv.php

INSERT INTO `boxes` (`nummer`, `token`, `status`, `created_at`, `updated_at`) VALUES (2, 'bcde', 'leeg', '2026-09-20 19:47:00', '2026-09-20 19:47:00')
---
                continue;
            }

            $boxes->insert(['nummer' => $nummer, 'token' => $code, 'status' => 'leeg']);

SELECT *
FROM `boxes`
ORDER BY `nummer` ASC
---
    public function export()
    {
        $rows = (new BoxModel())->orderBy('nummer', 'ASC')->findAll();