app/Controllers/Home.php

SELECT COUNT(*) AS `numrows` FROM `boxes`
---
    public function index()
    {
        $boxes = new BoxModel();
        $totaalAlles = $boxes->countAll();