app/Controllers/Move.php

SELECT *
FROM `boxes`
WHERE `boxes`.`id` = 1
INSERT INTO `movements` (`box_id`, `van_locatie`, `naar_locatie`, `door`, `op`, `batch_id`) VALUES (1, 'Zolder', 'Opslag rij 3', 'Edwin', '2026-09-20 19:46:52', '93e4d967d5cf85c0b9fc2541b298ee49')
---
    public function finish(string $batch)
    {
        $b = $this->activeBatch($batch);
        if (! $b || ! $b['items']) {
            session()->remove('move_batch');

            return redirect()->to('/verplaats');
        }

        $boxes     = new BoxModel();
        $movements = new MovementModel();
        $naam      = current_account_naam();
        $now       = date('Y-m-d H:i:s');

        foreach ($b['items'] as $item) {
            $current = $boxes->find($item['box_id']);
            if (! $current) {
                continue;
            }

            $movements->insert([
                'box_id'       => $item['box_id'],
                'van_locatie'  => $current['huidige_locatie'],
                'naar_locatie' => $b['bestemming'],
                'door'         => $naam,
                'op'           => $now,
                'batch_id'     => $b['id'],
            ]);

UPDATE `boxes` SET `huidige_locatie` = 'Opslag rij 3', `status` = 'opgeslagen', `updated_at` = '2026-09-20 19:46:52'
WHERE `boxes`.`id` IN (1)
---
            if ($current['status'] === 'ingepakt') {
                $update['status'] = 'opgeslagen';
            }
            $boxes->update($item['box_id'], $update);