app/Controllers/Overview.php

SELECT *
FROM `boxes`
WHERE `status` != 'leeg'
SELECT DISTINCT `eigenaar`
FROM `boxes`
WHERE `eigenaar` IS NOT NULL
AND `eigenaar` != ''
ORDER BY `eigenaar`
---
    public function index()
    {
        // Eigenaar is inhoud-informatie: sjouwers filteren er niet op (handoff.md §2).
        $magEigenaar = access()->can('helper');
        $eigenaar    = $magEigenaar ? trim((string) $this->request->getGet('eigenaar')) : '';

        $boxes = new BoxModel();
        $boxes->where('status !=', 'leeg');
        if ($eigenaar !== '') {
            $boxes->where('eigenaar', $eigenaar);
        }
        $rows = $boxes->findAll();

        $eigenaars = $magEigenaar ? array_column(
            (new BoxModel())->distinct()->select('eigenaar')->where('eigenaar IS NOT NULL')->where('eigenaar !=', '')->orderBy('eigenaar')->findAll(),
            'eigenaar'
        ) : [];

SELECT *
FROM `boxes`
WHERE `status` != 'leeg'
AND `status` = 'ingepakt'
ORDER BY `nummer` ASC
---
    public function list()
    {
        $kind = $this->request->getGet('kind');
        $val  = $this->request->getGet('val');
        $sort = $this->request->getGet('sort') === 'recent' ? 'recent' : 'nr';

        $builder = (new BoxModel())->where('status !=', 'leeg');

        $titel = 'Alle dozen';
        if ($kind === 'status' && $val) {
            $vals = array_filter(explode(',', $val));
            if (count($vals) > 1) {
                $builder->whereIn('status', $vals);
                $titel = 'Open doos';
            } else {
                $builder->where('status', $val);
                $titel = status_pill($val)['label'];
            }
        } elseif ($kind === 'plek' && $val) {
            $builder->where('huidige_locatie', $val === 'Nog niet bepaald' ? null : $val);
            $titel = $val;
        } elseif ($kind === 'doel' && $val) {
            $builder->where('einddoel', $val === 'Nog niet bepaald' ? null : $val);
            $titel = $val;
        } elseif ($kind === 'eigenaar' && $val && access()->can('helper')) {
            $builder->where('eigenaar', $val);
            $titel = $val;
        }

        $rows = $builder->orderBy($sort === 'recent' ? 'updated_at' : 'nummer', $sort === 'recent' ? 'DESC' : 'ASC')->findAll();