app/Controllers/Photo.php

    public function show(int $id)
    {
        $photo = (new PhotoModel())->find($id);
---
SELECT *
FROM `photos`
WHERE `photos`.`id` = 1