app/Models/AccountSessionModel.php

    public function createFor(int $accountId): string
    {
        $token = bin2hex(random_bytes(32));
        $this->insert(['account_id' => $accountId, 'token' => $token]);
---
INSERT INTO `account_sessions` (`account_id`, `token`) VALUES (1, 'd3504acefe069d7100468004c2216a5546050640bb7df09b9206eebb4f5d09d5')

    public function deleteByToken(string $token): void
    {
        $this->where('token', $token)->delete();
---
DELETE FROM `account_sessions`
WHERE `token` = '02e135cb1fdb7453d4b7cd915c057ecdcf35785f3ec3f25a3265e6b8783658f5'