app/Models/AccountModel.php

    public function findByPincode(string $pincode): ?array
    {
        return $this->where('pincode', $pincode)->first();
---
SELECT *
FROM `accounts`
WHERE `pincode` = '2905'
 LIMIT 1