app/Models/BoxModel.php

    public function findByNummer(int $nummer): ?array
    {
        return $this->where('nummer', $nummer)->first();
---
SELECT *
FROM `boxes`
WHERE `nummer` = 1
 LIMIT 1

    public function ownerSuggestions(int $limit = 8): array
    {
        $rows = $this->select('eigenaar, COUNT(*) as n')
            ->where('eigenaar IS NOT NULL')
            ->where('eigenaar !=', '')
            ->groupBy('eigenaar')
            ->orderBy('n', 'DESC')
            ->limit($limit)
            ->findAll();
---
SELECT `eigenaar`, COUNT(*) as n
FROM `boxes`
WHERE `eigenaar` IS NOT NULL
AND `eigenaar` != ''
GROUP BY `eigenaar`
ORDER BY `n` DESC
 LIMIT 8

    public function search(string $q): array
    {
        $builder = $this->groupStart()
            ->like('omschrijving', $q)
            ->orLike('eigenaar', $q);

        if (ctype_digit($q)) {
            $builder->orWhere('nummer', (int) $q);
        }
        $builder->groupEnd();

        return $this->where('status !=', 'leeg')->orderBy('updated_at', 'DESC')->findAll(200);
---
SELECT *
FROM `boxes`
WHERE   (
`omschrijving` LIKE '%servies%' ESCAPE '!'
OR  `eigenaar` LIKE '%servies%' ESCAPE '!'
 )
AND `status` != 'leeg'
ORDER BY `updated_at` DESC
 LIMIT 200

    public function counts(): array
    {
        $rows = $this->select('status, COUNT(*) as n')->groupBy('status')->findAll();
---
SELECT `status`, COUNT(*) as n
FROM `boxes`
GROUP BY `status`