app/Models/LocationModel.php

    public function remember(string $naam, string $soort = 'overig'): void
    {
        $naam = trim($naam);
        if ($naam === '') {
            return;
        }
        $exists = $this->where('naam', $naam)->first();
        if (! $exists) {
            $this->insert(['naam' => $naam, 'soort' => $soort, 'actief' => 1]);
---
SELECT *
FROM `locations`
WHERE `naam` = 'Nieuw huis woonkamer'
 LIMIT 1
INSERT INTO `locations` (`naam`, `soort`, `actief`) VALUES ('Nieuw huis woonkamer', 'overig', 1)

    public function suggestions(?string $soort = null, int $limit = 12): array
    {
        $builder = $this->where('actief', 1);
        if ($soort) {
            $builder->where('soort', $soort);
        }

        return array_column($builder->orderBy('naam', 'ASC')->limit($limit)->findAll(), 'naam');
---
SELECT *
FROM `locations`
WHERE `actief` = 1
AND `soort` = 'nieuw huis'
ORDER BY `naam` ASC
 LIMIT 12