app/Models/MovementModel.php

    public function journeyFor(int $boxId, int $limit = 20): array
    {
        return $this->where('box_id', $boxId)->orderBy('op', 'DESC')->limit($limit)->findAll();
---
SELECT *
FROM `movements`
WHERE `box_id` = 1
ORDER BY `op` DESC
 LIMIT 20

    public function recentDestinations(int $limit = 8, array $exclude = []): array
    {
        $builder = $this->select('naar_locatie, MAX(op) as laatst')
            ->groupBy('naar_locatie')
            ->orderBy('laatst', 'DESC');

        if ($exclude) {
            $builder->whereNotIn('naar_locatie', $exclude);
        }

        return array_column($builder->limit($limit)->findAll(), 'naar_locatie');
---
SELECT `naar_locatie`, MAX(op) as laatst
FROM `movements`
GROUP BY `naar_locatie`
ORDER BY `laatst` DESC
 LIMIT 8