app/Models/PhotoModel.php

    public function forBox(int $boxId): array
    {
        return $this->where('box_id', $boxId)->orderBy('op', 'ASC')->findAll();
---
SELECT *
FROM `photos`
WHERE `box_id` = 1
ORDER BY `op` ASC